---
kind: property
id: P:Autodesk.Revit.DB.ColorFillLegend.ColorFillCategoryId
source: html/7fe9c873-16d6-d661-e6dc-94fd1c7d2d69.htm
---
# Autodesk.Revit.DB.ColorFillLegend.ColorFillCategoryId Property

Returns the id of color fill category that this legend is created for.

## Syntax (C#)
```csharp
public ElementId ColorFillCategoryId { get; }
```